[
  {
    "id": 1,
    "title": "Mon Vieux Grimoire",
    "description": "Application de notation de livres avec authentification, backend Node.js et base MongoDB. Projet fullstack complet.",
    "difficulty": "La gestion des erreurs et des routes dans une API REST m’a posé problème au début, mais j’ai mis en place une architecture claire en middleware et testé chaque endpoint avec Postman pour garantir la stabilité du back-end",
    "image": "/images/mon-vieux-grimoire.webp",
    "techs": ["MongoDB", "Node.js", "Express", "JWT", "Multer"],
    "codeUrl": "https://github.com/aurelienrnd/Le_Vieux_Grimoire_Backend.git"
  },
  {
    "id": 2,
    "title": "Kasa",
    "description": "Application de location avec React et composants dynamiques.",
    "difficulty": "J’ai été confronté à la complexité des routes dynamiques avec React Router, que j’ai réussi à dompter en structurant soigneusement mes composants",
    "image": "/images/kasa.webp",
    "techs": ["React", "Sass"],
    "codeUrl": "https://github.com/aurelienrnd/kasa"
  },
  {
    "id": 3,
    "title": "Booki",
    "description": "Site vitrine responsive d’une agence de voyage, réalisé en HTML et CSS, avec respect des maquettes et accessibilité.",
    "difficulty": "Respecter fidèlement les maquettes fournies en pixel-perfect tout en assurant une bonne accessibilité a été un vrai défi. J’ai appris à utiliser des outils comme les grilles CSS, les balises sémantiques, et à corriger les erreurs d’accessibilité.",
    "image": "/images/booki.webp",
    "techs": ["HTML", "CSS"],
    "codeUrl": "https://github.com/aurelienrnd/booki"
  },
  {
    "id": 4,
    "title": "Portfolio",
    "description": "Site personnel de présentation, codé en React, TypeScript et TailwindCSS v4. Responsive, clair et optimisé SEO.",
    "difficulty": "N’ayant jamais utilisé TypeScript ni TailwindCSS v4, j’ai dû surmonter une courbe d’apprentissage abrupte en suivant des tutoriels ciblés et en explorant activement la documentation pour comprendre la logique des types et des classes utilitaires.",
    "image": "/images/portfolio.webp",
    "techs": ["React", "TypeScript", "TailwindCSS", "Vite"],
    "codeUrl": "https://github.com/aurelienrnd/portfolio",
    "siteUrl": "https://aurelienrnd-portfolio.netlify.app"
  }
]
